[
  {
    "name": "J.K. Rowling",
    "image": "fvh43djng407r1iq142ng0sk5f._SY600_.jpg",
    "bio": "J.K. Rowling is best-known as the author of the seven Harry Potter books, which were published between 1997 and 2007. The enduringly popular adventures of Harry, Ron and Hermione have gone on to sell over 500 million copies, be translated into over 80 languages and made into eight blockbuster films.\\n\\nAlongside the Harry Potter series, J.K. Rowling also wrote three short companion volumes for charity: Quidditch Through the Ages and Fantastic Beasts and Where to Find Them, in aid of Comic Relief, and The Tales of Beedle the Bard, in aid of Lumos. The companion books and original series are all available as audiobooks.\\n\\nIn 2016, J.K. Rowling collaborated with playwright Jack Thorne and director John Tiffany to continue Harry’s story in a stage play, Harry Potter and the Cursed Child, which opened in London, followed by the USA and Australia.\\n\\nIn the same year, she made her debut as a screenwriter with the film Fantastic Beasts and Where to Find Them. Inspired by the original companion volume, it was the first in a series of new adventures featuring wizarding world magizoologist Newt Scamander. The second, Fantastic Beasts: The Crimes of Grindelwald, was released in 2018 and the third, Fantastic Beasts: The Secrets of Dumbledore is to be released in April 2022.\\n\\nBoth the screenplays, as well as the script of Harry Potter and the Cursed Child, are also available as books.\\n\\nFans of Fantastic Beasts and Harry Potter can find out more at www.wizardingworld.com.\\n\\nJ.K. Rowling also writes novels for adults. The Casual Vacancy was published in 2012 and adapted for television in 2015. Under the pseudonym Robert Galbraith, she is the author of the highly acclaimed ‘Strike’ crime series, featuring private detective Cormoran Strike and his partner Robin Ellacott. The first of these, The Cuckoo’s Calling, was published to critical acclaim in 2013, at first without its author’s true identity being known. The Silkworm followed in 2014, Career of Evil in 2015 and Lethal White in 2018. All four books have been adapted for television by the BBC and HBO. The fifth book, Troubled Blood, is now out and was also an instant bestseller.\\n\\nJ.K. Rowling’s 2008 Harvard Commencement speech was published in 2015 as an illustrated book, Very Good Lives: The Fringe Benefits of Failure and the Importance of Imagination, sold in aid of Lumos and university-wide financial aid at Harvard.\\n\\nIn 2020, J.K. Rowling released in free online instalments, The Ickabog, an original fairy tale, which she wrote over ten years ago as a bedtime story for her younger children. She decided to share the personal family favourite to help entertain children, parents and carers confined at home during the Covid-19 lockdown.\\n\\nThe story is now published as a book (hardback, ebook and audio) in the English language, and is translated into 26 languages, each edition with its own unique illustrations by children. J.K. Rowling is donating her royalties from The Ickabog to her charitable trust, The Volant Charitable Trust, to assist vulnerable groups who have been particularly impacted by the Covid-19 pandemic in the UK and internationally.\\n\\nJ.K. Rowling’s latest children’s novel, The Christmas Pig, is out now. Illustrated by Jim Field, it’s the story of a little boy called Jack, and his beloved toy, Dur Pig, and the toy that replaces Dur Pig when he’s lost on Christmas Eve – the Christmas Pig. Together, Jack and the Christmas Pig embark on a magical journey to seek something lost, and to save the best friend Jack has ever known.\\n\\nAs well as receiving an OBE and Companion of Honour for services to children’s literature, J.K. Rowling has received many other awards and honours, including France’s Legion d’Honneur, Spain’s Prince of Asturias Award and Denmark’s Hans Christian Andersen Award.",
    "books": [
      "0590353403",
      "0590353403",
      "0439136350",
      "0439139597",
      "9780439358064",
      "0439784549",
      "0545010225"
    ]
  },
  {
    "name": "James Clear",
    "image": "rec58e62v0epfogin4i1o6mu55._SY600_.jpg",
    "bio": "James Clear is a writer and speaker focused on habits, decision making, and continuous improvement. He is the author of the #1 New York Times bestseller, Atomic Habits. The book has sold over 5 million copies worldwide and has been translated into more than 50 languages.\\n\\nClear is a regular speaker at Fortune 500 companies and his work has been featured in places like Time magazine, the New York Times, the Wall Street Journal and on CBS This Morning. His popular \"3-2-1\" email newsletter is sent out each week to more than 1 million subscribers.",
    "books": ["0735211299"]
  },
  {
    "name": "Mark Manson",
    "image": "ppppnrtb11dqtjikkq5carfg90._SY600_.jpg",
    "bio": "Mark Manson is the #1 New York Times Bestselling author of Everything is F*cked: A Book About Hope and The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life, the mega-bestseller that reached #1 in fourteen different countries. Mark’s books have been translated into more than 50 languages and have sold over 12 million copies worldwide.\\n\\nMark runs one of the largest personal growth websites in the world, MarkManson.net, a blog with more than two million monthly readers and half a million subscribers. His writing is often described as ‘self-help for people who hate self-help’ — a no-BS brand of life advice and cultural commentary that has struck a chord with people around the globe. His writing has appeared in The New York Times, Wall Street Journal, TIME Magazine, Forbes, Vice, CNN, and Vox, among many others. He currently lives in New York City.",
    "books": ["0062457713", "0062888439"]
  },
  {
    "name": "Dan Brown",
    "image": "qn07ncrnfqmdrt7iaqdogv4tuv._SY600_.jpg",
    "bio": "Mark Manson is the #1 New York Times Bestselling author of Everything is F*cked: A Book About Hope and The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life, the mega-bestseller that reached #1 in fourteen different countries. Mark’s books have been translated into more than 50 languages and have sold over 12 million copies worldwide.\\n\\nMark runs one of the largest personal growth websites in the world, MarkManson.net, a blog with more than two million monthly readers and half a million subscribers. His writing is often described as ‘self-help for people who hate self-help’ — a no-BS brand of life advice and cultural commentary that has struck a chord with people around the globe. His writing has appeared in The New York Times, Wall Street Journal, TIME Magazine, Forbes, Vice, CNN, and Vox, among many others. He currently lives in New York City.",
    "books": ["074349346X"]
  },
  {
    "name": "Robert T. Kiyosaki",
    "image": "31H4fUBky1L._SX450_.jpg",
    "bio": "Robert Kiyosaki, author of Rich Dad Poor Dad - the international runaway bestseller that has held a top spot on the New York Times bestsellers list for over six years - is an investor, entrepreneur and educator whose perspectives on money and investing fly in the face of conventional wisdom. He has, virtually single-handedly, challenged and changed the way tens of millions, around the world, think about money.In communicating his point of view on why 'old' advice - get a good job, save money, get out of debt, invest for the long term, and diversify - is 'bad' (both obsolete and flawed) advice, Robert has earned a reputation for straight talk, irreverence and courage.Rich Dad Poor Dad ranks as the longest-running bestseller on all four of the lists that report to Publisher's Weekly - The New York Times, Business Week, The Wall Street Journal and USA Today - and was named \"USA Today's #1 Money Book\" two years in a row. It is the third longest-running 'how-to' best seller of all time.Translated into 51 languages and available in 109 countries, the Rich Dad series has sold over 27 million copies worldwide and has dominated best sellers lists across Asia, Australia, South America, Mexico and Europe. In 2005, Robert was inducted into Amazon.com Hall of Fame as one of that bookseller's Top 25 Authors. There are currently 26 books in the Rich Dad series.In 2006 Robert teamed up with Donald Trump to co-author Why We Want You To Be Rich - Two Men - One Message. It debuted at #1 on The New York Times bestsellers list.Robert writes a bi-weekly column - 'Why the Rich Are Getting Richer' - for Yahoo! Finance and a monthly column titled 'Rich Returns' for Entrepreneur magazine.Prior to writing Rich Dad Poor Dad, Robert created the educational board game CASHFLOW 101 to teach individuals the financial and investment strategies that his rich dad spent years teaching him. It was those same strategies that allowed Robert to retire at age 47.Today there are more that 2,100 CASHFLOW Clubs - game groups independent of the Rich Dad Company - in cities throughout the world.Born and raised in Hawaii, Robert Kiyosaki is a fourth-generation Japanese-American. After graduating from college in New York, Robert joined the Marine Corps and served in Vietnam as an officer and helicopter gunship pilot. Following the war, Robert went to work in sales for Xerox Corporation and, in 1977, started a company that brought the first nylon and Velcro 'surfer wallets' to market. He founded an international education company in 1985 that taught business and investing to tens of thousands of students throughout the world.  In 1994 Robert sold his business and, through his investments, was able to retire at the age of 47.",
    "books": ["1612680194"]
  },
  {
    "name": "John Grisham",
    "image": "d661gj9v9di7dgupcm7st49gpt._SX450_.jpg",
    "bio": "Long before his name became synonymous with the modern legal thriller, he was working 60-70 hours a week at a small Southaven, Mississippi, law practice, squeezing in time before going to the office and during courtroom recesses to work on his hobby—writing his first novel.\\n\\nBorn on February 8, 1955 in Jonesboro, Arkansas, to a construction worker and a homemaker, John Grisham as a child dreamed of being a professional baseball player. Realizing he didn’t have the right stuff for a pro career, he shifted gears and majored in accounting at Mississippi State University. After graduating from law school at Ole Miss in 1981, he went on to practice law for nearly a decade in Southaven, specializing in criminal defense and personal injury litigation. In 1983, he was elected to the state House of Representatives and served until 1990.\\n\\nOne day at the DeSoto County courthouse, Grisham overheard the harrowing testimony of a twelve-year-old rape victim and was inspired to start a novel exploring what would have happened if the girl’s father had murdered her assailants. Getting up at 5 a.m. every day to get in several hours of writing time before heading off to work, Grisham spent three years on A Time to Kill and finished it in 1987. Initially rejected by many publishers, it was eventually bought by Wynwood Press, who gave it a modest 5,000 copy printing and published it in June 1988.\\n\\nThat might have put an end to Grisham’s hobby. However, he had already begun his next book, and it would quickly turn that hobby into a new full-time career—and spark one of publishing’s greatest success stories. The day after Grisham completed A Time to Kill, he began work on another novel, the story of a hotshot young attorney lured to an apparently perfect law firm that was not what it appeared. When he sold the film rights to The Firm to Paramount Pictures for $600,000, Grisham suddenly became a hot property among publishers, and book rights were bought by Doubleday. Spending 47 weeks on The New York Times bestseller list, The Firm became the bestselling novel of 1991.\\n\\nThe successes of The Pelican Brief, which hit number one on the New York Times bestseller list, and The Client, which debuted at number one, confirmed Grisham’s reputation as the master of the legal thriller. Grisham’s success even renewed interest in A Time to Kill, which was republished in hardcover by Doubleday and then in paperback by Dell. This time around, it was a bestseller.\\n\\nSince first publishing A Time to Kill in 1988, Grisham has written at least one book a year (his other works are The Firm, The Pelican Brief, The Client, The Chamber, The Rainmaker, The Runaway Jury, The Partner, The Street Lawyer, The Testament, The Brethren, A Painted House, Skipping Christmas, The Summons, The King of Torts, Bleachers, The Last Juror, The Broker, Playing for Pizza, The Appeal, The Associate, The Confession, The Litigators, Calico Joe, The Racketeer, Sycamore Row, Gray Mountain, Rogue Lawyer, The Whistler, Camino Island, The Rooster Bar, The Reckoning, and The Guardians) and all of them have become international bestsellers. There are currently more than 350 million John Grisham books in print worldwide, which have been translated into 45 languages. Nine of his novels have been turned into films (The Firm, The Pelican Brief, The Client, A Time to Kill, The Rainmaker, The Chamber, A Painted House, The Runaway Jury, and Skipping Christmas), as was an original screenplay, The Gingerbread Man. The Innocent Man (October 2006) marked his first foray into non-fiction, and Ford County (November 2009) was his first short story collection. In addition, Grisham has written seven novels for young adults, all in the Theodore Boone series: Kid Lawyer, The Abduction, The Accused, The Activist, The Fugitive, The Scandal, and The Accomplice.\\n\\nGrisham took time off from writing for several months in 1996 to return, after a five-year hiatus, to the courtroom. He was honoring a commitment made before he had retired from the law to become a full-time writer: representing the family of a railroad brakeman killed when he was pinned between two cars. Preparing his case with the same passion and dedication as his books’ protagonists, Grisham successfully argued his clients’ case, earning them a jury award of $683,500—the biggest verdict of his career.",
    "books": ["0385541198", "0385546025"]
  }
]
