[
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "summary": "Harry Potter spent ten long years living with Mr. and Mrs. Dursley, an aunt and uncle whose outrageous favoritism of their perfectly awful son Dudley leads to some of the most inspired dark comedy since Charlie and the Chocolate Factory. But fortunately for Harry, he's about to be granted a scholarship to a unique boarding school called THE HOGWARTS SCHOOL OF WITCHCRAFT AND WIZARDRY, where he will become a school hero at the game of Quidditch (a kind of aerial soccer played high above the ground on broomsticks), he will make some wonderful friends, and, unfortunately, a few terrible enemies. For although he seems to be getting your run-of-the-mill boarding school experience (well, ok, even that's pretty darn out of the ordinary), Harry Potter has a destiny that he was born to fulfill. A destiny that others would kill to keep him from.",
    "url": "https://www.amazon.com/Harry-Potter-Sorcerers-Stone-Rowling/dp/0590353403/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324054&sr=1-3",
    "hard_cover_price": 26.99,
    "hard_cover_discounted_price": 12.0,
    "paper_back_price": 10.99,
    "paper_back_discounted_price": 6.98,
    "language": "english",
    "year": 1998,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 309,
    "reading_age": 9,
    "isbn_10": "0590353403",
    "book_id": "0590353403",
    "item_weight_pounds": 1.55,
    "stock_qty": 23,
    "dimensions": [6.1, 1.3, 9.1],
    "is_bestseller": false,
    "images": [
      "51DF6ZR8G7L._SX329_BO1,204,203,200_.jpg",
      "911ohN5NhtL.jpg",
      "41eBNoDgiXL.jpeg"
    ],
    "number_of_reviews": 7425,
    "rating": 4.9,
    "reviews": [1, 2, 3]
  },
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "author": "J.K. Rowling",
    "summary": "'There is a plot, Harry Potter. A plot to make most terrible things happen at Hogwarts School of Witchcraft and Wizardry this year.'\\n\\nHarry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft and Wizardry for his second year, Harry hears strange whispers echo through empty corridors - and then the attacks start. Students are found as though turned to stone... Dobby's sinister predictions seem to be coming true.\\n\\nHaving now become classics of our time, the Harry Potter ebooks never fail to bring comfort and escapism to readers of all ages. With its message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "url": "https://www.amazon.com/Harry-Potter-Chamber-Secrets-Rowling/dp/0439064864/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324054&sr=1-4",
    "hard_cover_price": 26.99,
    "hard_cover_discounted_price": 14.16,
    "paper_back_price": 10.99,
    "paper_back_discounted_price": 6.98,
    "language": "english",
    "year": 2000,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 341,
    "reading_age": 9,
    "isbn_10": "9780439064866",
    "book_id": "0590353403",
    "item_weight_pounds": 1.8,
    "stock_qty": 15,
    "dimensions": [5.2, 1, 7.5],
    "is_bestseller": false,
    "images": [
      "0439064872.01._SCLZZZZZZZ_SX500_.jpg",
      "81XiYFe9qwL.jpeg",
      "41zOCbizrZL.jpeg"
    ],
    "number_of_reviews": 36700,
    "rating": 4.8,
    "reviews": [4, 5, 6]
  },
  {
    "title": "Harry Potter and the Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "summary": "For twelve long years, the dread fortress of Azkaban held an infamous prisoner named Sirius Black. Convicted of killing thirteen people with a single curse, he was said to be the heir apparent to the Dark Lord, Voldemort.Now he has escaped, leaving only two clues as to where he might be headed: Harry Potter's defeat of You-Know-Who was Black's downfall as well. And the Azkaban guards heard Black muttering in his sleep, \"He's at Hogwarts . . . he's at Hogwarts.\" Harry Potter isn't safe, not even within the walls of his magical school, surrounded by his friends. Because on top of it all, there may well be a traitor in their midst.",
    "url": "https://www.amazon.com/Harry-Potter-Prisoner-Azkaban-Rowling/dp/0439136350/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324054&sr=1-12",
    "hard_cover_price": 26.99,
    "hard_cover_discounted_price": 13.02,
    "paper_back_price": 12.99,
    "paper_back_discounted_price": 8.16,
    "language": "english",
    "year": 1999,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 435,
    "reading_age": 9,
    "isbn_10": "0439136350",
    "book_id": "0439136350",
    "item_weight_pounds": 2.1,
    "stock_qty": 18,
    "dimensions": [6.38, 1.41, 9.24],
    "is_bestseller": false,
    "images": ["81lAPl9Fl0L.jpeg", "814bbGKEiML.jpeg", "310BcUXm1jL.jpeg"],
    "number_of_reviews": 37302,
    "rating": 4.9,
    "reviews": [7, 8, 9]
  },
  {
    "title": "Harry Potter and the Goblet of Fire",
    "author": "J.K. Rowling",
    "summary": "'There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways ... their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.'\\n\\nThe Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive!\\n\\nHaving now become classics of our time, the Harry Potter ebooks never fail to bring comfort and escapism to readers of all ages. With its message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "url": "https://www.amazon.com/Harry-Potter-Goblet-Fire-Book/dp/0439139597/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324054&sr=1-6",
    "hard_cover_price": 29.99,
    "hard_cover_discounted_price": 23.18,
    "paper_back_price": 19.98,
    "paper_back_discounted_price": 23.99,
    "language": "english",
    "year": 1999,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 752,
    "reading_age": 9,
    "isbn_10": "0439139597",
    "book_id": "0439139597",
    "item_weight_pounds": 2.47,
    "stock_qty": 30,
    "dimensions": [6.4, 2.3, 9.1],
    "is_bestseller": false,
    "images": ["91gZX7sjnpL.jpeg", "815si5pgbaL.jpeg", "315k+ZV6wkL.jpeg"],
    "number_of_reviews": 34426,
    "rating": 4.9,
    "reviews": [10, 11, 12]
  },
  {
    "title": "Harry Potter and the Order of the Phoenix",
    "author": "J.K. Rowling",
    "summary": "'There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways ... their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.'\\n\\nThe Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive!\\n\\nHaving now become classics of our time, the Harry Potter ebooks never fail to bring comfort and escapism to readers of all ages. With its message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "url": "https://www.amazon.com/Harry-Potter-Order-Phoenix-Book/dp/043935806X/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324054&sr=1-1",
    "hard_cover_price": 29.99,
    "hard_cover_discounted_price": 13.69,
    "paper_back_price": 14.99,
    "paper_back_discounted_price": 9.02,
    "language": "english",
    "year": 2003,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 896,
    "reading_age": 9,
    "isbn_10": "9780439358064",
    "book_id": "9780439358064",
    "item_weight_pounds": 2.65,
    "stock_qty": 9,
    "dimensions": [6.4, 2.1, 9.25],
    "is_bestseller": false,
    "images": ["51lFAzVQUxL._SX342_BO1,204,203,200_.jpg"],
    "number_of_reviews": 34203,
    "rating": 4.9,
    "reviews": [13, 14, 15]
  },
  {
    "title": "Harry Potter and the Half-Blood Prince",
    "author": "J.K. Rowling",
    "summary": "As the Harry Potter sequence draws to a close, Harry's most dangerous adventure yet is just beginning . . . and it starts July 16, 2005.\\n\\nWe could tell you, but then we'd have to Obliviate your memory.",
    "url": "https://www.amazon.com/Harry-Potter-Half-Blood-Prince-Book/dp/0439784549/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324117&sr=1-20",
    "hard_cover_price": 29.99,
    "hard_cover_discounted_price": 14.74,
    "paper_back_price": 14.99,
    "paper_back_discounted_price": 8.71,
    "language": "english",
    "year": 2005,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 672,
    "reading_age": 9,
    "isbn_10": "0439784549",
    "book_id": "0439784549",
    "item_weight_pounds": 2.45,
    "stock_qty": 9,
    "dimensions": [6.4, 2.1, 9.25],
    "is_bestseller": false,
    "images": ["61sXBXmAWML.jpeg", "41AZMJ2NX9L.jpeg", "41AZMJ2NX9L.jpeg"],
    "number_of_reviews": 30028,
    "rating": 4.9,
    "reviews": [16, 17, 18]
  },
  {
    "title": "Harry Potter and the Deathly Hallows",
    "author": "J.K. Rowling",
    "summary": "The magnificent final book in J. K. Rowling's seven-part saga comes to readers July 21, 2007.\\n\\nYou'll find out July 21!",
    "url": "https://www.amazon.com/Harry-Potter-Deathly-Hallows-Book/dp/0545010225/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646324054&sr=1-8",
    "hard_cover_price": 34.99,
    "hard_cover_discounted_price": 21.74,
    "paper_back_price": 16.99,
    "paper_back_discounted_price": 14.99,
    "language": "english",
    "year": 2007,
    "genres": ["fantasy", "children", "adventure", "narrative"],
    "number_of_pages": 784,
    "reading_age": 9,
    "isbn_10": "0545010225",
    "book_id": "0545010225",
    "item_weight_pounds": 2.4,
    "stock_qty": 19,
    "dimensions": [9.25, 6.25, 2],
    "is_bestseller": false,
    "images": [
      "811t1pfIZXL.jpeg",
      "81c4XsWk4HL.jpeg",
      "419zmkMA1dL.jpeg",
      "31iQsdV9K8L.jpeg"
    ],
    "number_of_reviews": 33008,
    "rating": 4.9,
    "reviews": [19, 20, 21]
  },
  {
    "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
    "author": "James Clear",
    "summary": "The #1 New York Times bestseller. Over 3 million copies sold!\\n\\nTiny Changes, Remarkable Results\\n\\nNo matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\\n\\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\\n\\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.\\n\\nLearn how to:\\n\\n•  make time for new habits (even when life gets crazy);\\n\\n•  overcome a lack of motivation and willpower;\\n\\n•  design your environment to make success easier;\\n\\n•  get back on track when you fall off course;\\n\\n...and much more.\\n\\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
    "url": "https://www.amazon.com/Atomic-Habits-Proven-Build-Break/dp/0735211299/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646329238&sr=1-1",
    "hard_cover_price": 27.0,
    "hard_cover_discounted_price": 11.98,
    "paper_back_price": 20.0,
    "paper_back_discounted_price": 16.0,
    "language": "english",
    "year": 2018,
    "genres": ["self-help"],
    "number_of_pages": 320,
    "reading_age": null,
    "isbn_10": "0735211299",
    "book_id": "0735211299",
    "item_weight_pounds": 2.4,
    "stock_qty": 19,
    "dimensions": [6.26, 1.01, 9.25],
    "is_bestseller": true,
    "images": [
      "91-EIJiYneL.jpeg",
      "81byNvv6hoL.jpeg",
      "41dKEuW-uOS.jpeg",
      "81cwfUZPr-S.jpeg"
    ],
    "number_of_reviews": 69431,
    "rating": 4.8,
    "reviews": [22, 23, 24]
  },
  {
    "title": "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life",
    "author": "Mark Manson",
    "summary": "#1 New York Times Bestseller\\n\\nOver 10 million copies sold\\n\\nIn this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be \"positive\" all the time so that we can truly become better, happier people.\\n\\nFor decades, we’ve been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let’s be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn’t sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let’s-all-feel-good mindset that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up.\\n\\nManson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited—\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek.\\n\\nThere are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.",
    "url": "https://www.amazon.com/Subtle-Art-Not-Giving-Counterintuitive/dp/0062457713/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1646329229&sr=1-1",
    "hard_cover_price": 26.99,
    "hard_cover_discounted_price": 13.76,
    "paper_back_price": 16.99,
    "paper_back_discounted_price": 12.19,
    "language": "english",
    "year": 2016,
    "genres": ["self-help"],
    "number_of_pages": 224,
    "reading_age": null,
    "isbn_10": "0062457713",
    "book_id": "0062457713",
    "item_weight_pounds": 0.6,
    "stock_qty": 24,
    "dimensions": [20.95, 13.97, 2.06],
    "is_bestseller": true,
    "images": ["71QKQ9mwV7L.jpeg", "51pCXWFd7CL.jpeg", "413R2vCAcLL.jpeg"],
    "number_of_reviews": 62737,
    "rating": 4.8,
    "reviews": [25, 26, 27]
  },
  {
    "title": "Everything Is F*cked: A Book about Hope",
    "author": "Mark Manson",
    "summary": "NEW YORK TIMES BESTSELLER\\n\\nFrom the author of the international mega-bestseller The Subtle Art of Not Giving A F*ck comes a counterintuitive guide to the problems of hope.\\n\\nWe live in an interesting time. Materially, everything is the best it’s ever been—we are freer, healthier and wealthier than any people in human history. Yet, somehow everything seems to be irreparably and horribly f*cked—the planet is warming, governments are failing, economies are collapsing, and everyone is perpetually offended on Twitter. At this moment in history, when we have access to technology, education and communication our ancestors couldn’t even dream of, so many of us come back to an overriding feeling of hopelessness.\\n\\nWhat’s going on? If anyone can put a name to our current malaise and help fix it, it’s Mark Manson. In 2016, Manson published The Subtle Art of Not Giving A F*ck, a book that brilliantly gave shape to the ever-present, low-level hum of anxiety that permeates modern living. He showed us that technology had made it too easy to care about the wrong things, that our culture had convinced us that the world owed us something when it didn’t—and worst of all, that our modern and maddening urge to always find happiness only served to make us unhappier. Instead, the “subtle art” of that title turned out to be a bold challenge: to choose your struggle; to narrow and focus and find the pain you want to sustain. The result was a book that became an international phenomenon, selling millions of copies worldwide while becoming the #1 bestseller in 13 different countries.\\n\\nNow, in Everthing Is F*cked, Manson turns his gaze from the inevitable flaws within each individual self to the endless calamities taking place in the world around us. Drawing from the pool of psychological research on these topics, as well as the timeless wisdom of philosophers such as Plato, Nietzsche, and Tom Waits, he dissects religion and politics and the uncomfortable ways they have come to resemble one another. He looks at our relationships with money, entertainment and the internet, and how too much of a good thing can psychologically eat us alive. He openly defies our definitions of faith, happiness, freedom—and even of hope itself.\\n\\nWith his usual mix of erudition and where-the-f*ck-did-that-come-from humor, Manson takes us by the collar and challenges us to be more honest with ourselves and connected with the world in ways we probably haven’t considered before. It’s another counterintuitive romp through the pain in our hearts and the stress of our soul. One of the great modern writers has produced another book that will set the agenda for years to come.",
    "url": "https://www.amazon.com/dp/0062888439/ref=emc_b_5_i",
    "hard_cover_price": 26.99,
    "hard_cover_discounted_price": 23.99,
    "paper_back_price": 16.99,
    "paper_back_discounted_price": 12.4,
    "language": "english",
    "year": 2019,
    "genres": ["self-help"],
    "number_of_pages": 224,
    "reading_age": null,
    "isbn_10": "0062888439",
    "book_id": "0062888439",
    "item_weight_pounds": 0.6,
    "stock_qty": 24,
    "dimensions": [20.95, 13.97, 2.06],
    "is_bestseller": true,
    "images": ["7195f4cdAVL.jpeg", "51W9xGfqz0L.jpeg"],
    "number_of_reviews": 62737,
    "rating": 4.8,
    "reviews": [28, 29, 30]
  },
  {
    "title": "The Whistler: A Novel",
    "author": "John Grisham",
    "summary": "#1 NEW YORK TIMES BESTSELLER • A high-stakes thrill ride through the darkest corners of the Sunshine State, from the author hailed as “the best thriller writer alive” by Ken Follett\\n\\nWe expect our judges to be honest and wise. Their integrity is the bedrock of the entire judicial system. We trust them to ensure fair trials, to protect the rights of all litigants, to punish those who do wrong, and to oversee the flow of justice. But what happens when a judge bends the law or takes a bribe?\\n\\nLacy Stoltz is an investigator for the Florida Board on Judicial Conduct. It is her job to respond to complaints dealing with judicial misconduct. After nine years with the Board, she knows that most problems are caused by incompetence, not corruption.\\n\\nBut a corruption case eventually crosses her desk. A previously disbarred lawyer is back in business, and he claims to know of a Florida judge who has stolen more money than all other crooked judges combined. And not just crooked judges in Florida. All judges, from all states, and throughout United States history. And now he wants to put a stop to it. His only client is a person who knows the truth and wants to blow the whistle and collect millions under Florida law. When the case is assigned to Lacy, she immediately suspects that this one could be dangerous. Dangerous is one thing. Deadly is something else.\\n\\nLook for John Grisham’s new novel, The Judge’s List!\\n\\n“[A] main character [who’s] a seriously appealing woman . . . a whistle-blower who secretly calls attention to corruption . . . a strong and frightening sense of place . . . [John Grisham’s] on his game.”—Janet Maslin, The New York Times\\n\\n“[John Grisham is] our guide to the byways and backwaters of our legal system, superb in particular at ferreting out its vulnerabilities and dramatizing their abuse in gripping style.”—USA Today\\n\\n“Riveting . . . an elaborate conspiracy.”—The New York Times Book Review",
    "url": "https://www.amazon.com/Whistler-Novel-John-Grisham/dp/1101967676/ref=pd_bxgy_img_1/147-9659334-9126408?pd_rd_w=oWtEH&pf_rd_p=6b3eefea-7b16-43e9-bc45-2e332cbf99da&pf_rd_r=HAB1EWBN76HK1JJ9JKKE&pd_rd_r=6b9ddd0c-82d6-4a08-b4c9-e00e2d35a190&pd_rd_wg=47RIR&pd_rd_i=1101967676&psc=1",
    "hard_cover_price": 30,
    "hard_cover_discounted_price": 15.65,
    "paper_back_price": 18,
    "paper_back_discounted_price": 13.58,
    "language": "english",
    "year": 2016,
    "genres": [
      "novel",
      "suspense",
      "thriller",
      "fiction",
      "legal story",
      "mistery"
    ],
    "number_of_pages": 384,
    "reading_age": null,
    "isbn_10": "0385541198",
    "book_id": "0385541198",
    "item_weight_pounds": 1.5,
    "stock_qty": 4,
    "dimensions": [6.47, 1.36, 9.54],
    "is_bestseller": true,
    "images": ["91uu43VwWbL.jpeg"],
    "number_of_reviews": 9860,
    "rating": 4.5,
    "reviews": [31, 32, 33]
  },
  {
    "title": "The Judge's List: A Novel (The Whistler)",
    "author": "John Grisham",
    "summary": "#1 NEW YORK TIMES BEST SELLER • Investigator Lacy Stoltz follows the trail of a serial killer, and closes in on a shocking suspect—a sitting judge—in “one of the best crime reads of the year.... Bristling with high-tech detail and shivering with suspense.... Worth staying up all night to finish” (Wall Street Journal).\\n\\nIn The Whistler, Lacy Stoltz investigated a corrupt judge who was taking millions in bribes from a crime syndicate. She put the criminals away, but only after being attacked and nearly killed. Three years later, and approaching forty, she is tired of her work for the Florida Board on Judicial Conduct and ready for a change.\\n\\nThen she meets a mysterious woman who is so frightened she uses a number of aliases. Jeri Crosby’s father was murdered twenty years earlier in a case that remains unsolved and that has grown stone cold. But Jeri has a suspect whom she has become obsessed with and has stalked for two decades. Along the way, she has discovered other victims.\\n\\nSuspicions are easy enough, but proof seems impossible. The man is brilliant, patient, and always one step ahead of law enforcement. He is the most cunning of all serial killers. He knows forensics, police procedure, and most important: he knows the law.\\n\\nHe is a judge, in Florida—under Lacy’s jurisdiction.\\n\\nHe has a list, with the names of his victims and targets, all unsuspecting people unlucky enough to have crossed his path and wronged him in some way. How can Lacy pursue him, without becoming the next name on his list?\\n\\nThe Judge’s List is by any measure John Grisham’s most surprising, chilling novel yet.",
    "url": "https://www.amazon.com/Judges-List-Novel-John-Grisham/dp/0385546025/ref=sr_1_25?qid=1646346054&s=books&sr=1-25&srs=17143709011",
    "hard_cover_price": 29.95,
    "hard_cover_discounted_price": 14.22,
    "paper_back_price": null,
    "paper_back_discounted_price": null,
    "language": "english",
    "year": 2021,
    "genres": [
      "novel",
      "suspense",
      "thriller",
      "fiction",
      "legal story",
      "mistery"
    ],
    "number_of_pages": 368,
    "reading_age": null,
    "isbn_10": "0385546025",
    "book_id": "0385546025",
    "item_weight_pounds": 1.5,
    "stock_qty": 4,
    "dimensions": [6.45, 1.38, 9.53],
    "is_bestseller": true,
    "images": ["71uaJ2VSi8L.jpeg"],
    "number_of_reviews": 44047,
    "rating": 4.4,
    "reviews": [34, 35, 36]
  },
  {
    "title": "Rich Dad Poor Dad: What the Rich Teach Their Kids About Money That the Poor and Middle Class Do Not!",
    "author": "Robert T. Kiyosaki",
    "summary": "It's been nearly 25 years since Robert Kiyosaki’s Rich Dad Poor Dad first made waves in the Personal Finance arena.\\n\\nIt has since become the #1 Personal Finance book of all time... translated into dozens of languages and sold around the world.\\n\\nRich Dad Poor Dad is Robert's story of growing up with two dads — his real father and the father of his best friend, his rich dad — and the ways in which both men shaped his thoughts about money and investing. The book explodes the myth that you need to earn a high income to be rich and explains the difference between working for money and having your money work for you.\\n\\n20 Years... 20/20 Hindsight\\n\\nIn the 20th Anniversary Edition of this classic, Robert offers an update on what we’ve seen over the past 20 years related to money, investing, and the global economy. Sidebars throughout the book will take readers “fast forward” — from 1997 to today — as Robert assesses how the principles taught by his rich dad have stood the test of time.\\n\\nIn many ways, the messages of Rich Dad Poor Dad, messages that were criticized and challenged two decades ago, are more meaningful, relevant and important today than they were 20 years ago.\\n\\nAs always, readers can expect that Robert will be candid, insightful... and continue to rock more than a few boats in his retrospective.\\n\\nWill there be a few surprises? Count on it.\\n\\nRich Dad Poor Dad...\\n\\n• Explodes the myth that you need to earn a high income to become rich\\n\\n• Challenges the belief that your house is an asset\\n\\n• Shows parents why they can't rely on the school system to teach their kids\\n\\nabout money\\n\\n• Defines once and for all an asset and a liability\\n\\n• Teaches you what to teach your kids about money for their future financial\\n\\nsuccess",
    "url": "https://www.amazon.com/Rich-Dad-Poor-Teach-Middle/dp/1612680194/ref=rtpb_2/147-9659334-9126408?pd_rd_w=nD5VI&pf_rd_p=ab907333-063a-4de1-b403-0a312c047f32&pf_rd_r=8CZG1VRJXBQZRTRBE15C&pd_rd_r=0dd68b03-adde-46fb-96f7-7d95e2eefb24&pd_rd_wg=NR3A7&pd_rd_i=1612680194&psc=1",
    "hard_cover_price": null,
    "hard_cover_discounted_price": null,
    "paper_back_price": 8.99,
    "paper_back_discounted_price": 7.18,
    "language": "english",
    "year": 1997,
    "genres": ["personal finance", "non-fiction"],
    "number_of_pages": 336,
    "reading_age": null,
    "isbn_10": "1612680194",
    "book_id": "1612680194",
    "item_weight_pounds": 0.5,
    "stock_qty": 74,
    "dimensions": [4.25, 1, 7],
    "is_bestseller": true,
    "images": [
      "81bsw6fnUiL.jpeg",
      "81JAQKcKkBL.jpeg",
      "71IW+OslV3L.jpeg",
      "8167o-RD4eL.jpeg"
    ],
    "number_of_reviews": 66332,
    "rating": 4.7,
    "reviews": [37, 38, 39]
  },
  {
    "title": "Angels & Demons: A Novel (Robert Langdon)",
    "author": "Dan Brown",
    "summary": "The explosive Robert Langdon thriller from Dan Brown, the #1 New York Times bestselling author of The Da Vinci Code and Inferno—now a major film directed by Ron Howard and starring Tom Hanks and Felicity Jones.\\n\\nAn ancient secret brotherhood. A devastating new weapon of destruction. An unthinkable target. When world-renowned Harvard symbologist Robert Langdon is summoned to his first assignment to a Swiss research facility to analyze a mysterious symbol—seared into the chest of a murdered physicist—he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati...the most powerful underground organization ever to walk the earth. The Illuminati has now surfaced to carry out the final phase of its legendary vendetta against its most hated enemy—the Catholic Church.\\n\\nLangdon’s worst fears are confirmed on the eve of the Vatican’s holy conclave, when a messenger of the Illuminati announces they have hidden an unstoppable time bomb at the very heart of Vatican City. With the countdown under way, Langdon jets to Rome to join forces with Vittoria Vetra, a beautiful and mysterious Italian scientist, to assist the Vatican in a desperate bid for survival.\\n\\nEmbarking on a frantic hunt through sealed crypts, dangerous catacombs, deserted cathedrals, and the most secretive vault on earth, Langdon and Vetra follow a 400-year-old trail of ancient symbols that snakes across Rome toward the long-forgotten Illuminati lair...a clandestine location that contains the only hope for Vatican salvation.\\n\\nCritics have praised the exhilarating blend of relentless adventure, scholarly intrigue, and cutting wit found in Brown’s remarkable thrillers featuring Robert Langdon. An explosive international suspense, Angels & Demons marks this hero’s first adventure as it careens from enlightening epiphanies to dark truths as the battle between science and religion turns to war.",
    "url": "https://www.amazon.com/dp/074349346X/?_encoding=UTF8&pd_rd_w=KT14X&pf_rd_p=9aa30bae-d685-4626-879d-c38f81e830a3&pf_rd_r=ED0RCVHWK6XK4CRK52E5&pd_rd_r=8f996837-3377-4cb3-ae54-1a6187d92776&pd_rd_wg=VaP8t&ref_=bd_tags_dp_rec",
    "hard_cover_price": null,
    "hard_cover_discounted_price": null,
    "paper_back_price": 18.99,
    "paper_back_discounted_price": 14.94,
    "language": "english",
    "year": 2006,
    "genres": [
      "novel",
      "thriller",
      "crime fiction",
      "conspiracy fiction",
      "mistery",
      "suspense"
    ],
    "number_of_pages": 496,
    "reading_age": null,
    "isbn_10": "074349346X",
    "book_id": "074349346X",
    "item_weight_pounds": 0.95,
    "stock_qty": 30,
    "dimensions": [5.31, 1.2, 8.25],
    "is_bestseller": false,
    "images": ["71vK8XjRM+L.jpeg", "81XSR-eOmjL.jpeg", "31qyY9KlvBL.jpeg"],
    "number_of_reviews": 8401,
    "rating": 4.6,
    "reviews": [40, 41, 42]
  }
]
