[
  {
    "id": 1,
    "book_id": "0590353403",
    "username": "Marouane",
    "review_title": "Magnificent book",
    "rating": 5,
    "review_date": "2019-08-16",
    "review": "It was about time I started reading the HP books, and it was just as I expected them to be : Magical"
  },
  {
    "id": 2,
    "book_id": "0590353403",
    "username": "Mike S.",
    "review_title": "The book that started it all",
    "rating": 5,
    "review_date": "2022-01-08",
    "review": "This is, of course, the book that launched the multi-billion dollar franchise about the orphaned boy named Harry Potter that finds out he is a Wizard when he turns 10 years old, and has been accepted to Hogwart's School for Witches and Wizards. It would eventually spawn seven books, eight movies, a spin-off series, and a play. For the few who do not know the story, this book basically establishes Harry learning that his parents were Wizards and killed by an evil wizard named Voldemort, who also tried to kill Harry as an infant. The attempt to kill Harry failed, and Harry was sent by Albus Dumbledore, the headmaster of Hogwarts to live with his aunt and uncle and then chronicles his first year at Hogwarts where he meets two schoolmates who would become his best friends, Ron Weasley and Hermoine Granger.\\n\\nFor those who have seen the movie but have not yet read the book, this is the shortest of the novels so it has the least amount of material removed in the movie adaptation. That said, the movie did change some things and did shorten some sequences. For example, the opening sequence with the Dursleys is more extended in the novel and things like the trip to the zoo play out a bit differently than was shown in the movie. But, all the main plot points from the book ended up in the movie, especially once Harry gets to Hogwarts, so that will not be much different.\\n\\nThe book is age-appropriate for kids about 10-11 years old and up. Rowling intended that the kids reading it would be about the same age as the characters in the book, so for the first novel around 10-11 years old. The books get increasingly darker and more adult with each new book, but really for this book a kid only really needs to understand the concept of death and \"good guys\" versus \"bad guys\". Otherwise, the novel is pretty tame. It has a good blend of humor, action, and suspense, and touches on themes of family, friends, right vs. wrong, and the like. Even though it is technically a \"kids book\" it is enjoyable enough for an adult, and even though it was written in the mid to late 1990s, it holds up well enough to be enjoyable even years later. It can easily be enjoyed by people in their 20s, 30s, 40s, etc., whether your first experience with the Harry Potter universe was as a young kid, as a teenager, or (as in my case) as an adult because of watching the movies. And, because it is only a few hundred pages and meant for young kids to be able to read it, adults who are fairly quick readers can probably get through it in a couple of days without a problem.\\n\\nUltimately, by now anyone reading this likely knows enough about Harry Potter to know the overall story and knows whether they like it or not. But, if you are just getting introduced to the series and are looking at the reviews if you are into fantasy novels or themes like magic, this is definitely worth reading. While it is nowhere near the best book of the series, it does a good job establishing the main characters, telling the stand-alone portion of the story, inviting the Sorcerer's Stone, and setting up what is to come down the line."
  },
  {
    "id": 3,
    "book_id": "0590353403",
    "username": "Julia Boyd",
    "review_title": "Number 1 in my book collection!",
    "rating": 5,
    "review_date": "2020-09-04",
    "review": "This book now is number 1 in my big book collection! This book was very suspenseful and funny! ONE of my favorite parts was where he played quidditch! It told about every second of it! I wasn’t really a big fan of Harry Potter until I started reading the first book! I really recommend reading this! It’s a magical and suspenseful ride even if you already watched the first movie."
  },
  {
    "id": 4,
    "book_id": "0590353403",
    "username": "Amanda Carey",
    "review_title": "No ones a muggle when you read potter!",
    "rating": 5,
    "review_date": "2015-05-19",
    "review": "I didn't read Potter as a child, unfortunately Christians were making a fuss over it and it was banned. Now as an adult with an 11 year old daughter I delved in and having read the firs chapter of the first book , I declared I didn't get the fuss...\\n\\nI am now in my second read through of the books. I finished them in three weeks. We've watched the first three movies and I await my daughter finishing each box anxiously so we can watch the next!\\n\\nThe books are so well written they transport you, nothing less. It's a great escape at the end of the day.\\n\\nAs for all the Christian hullabaloo there's no real magic in the book. It's on par with bewitched or cartoons. I suppose if you're the type to ban Disney then these aren't for you, but for the rest of the population they're really harmless and silly.\\n\\nThe later books are a bit darker but the first several are really kind of cartoon magic.\\n\\nThis second book is better than the first as we are already introduced to all the characters. Character development and friendships deepen in the second book and you begin to become attached to the little magicians and start to realize why this series created such a rabid fandom.\\n\\nThe books are adventurous and imaginative and have so much heart. The stories are packed with substance- very little to no filler in these books. They're a kids series, but it's the first time in a long time I have read a book and didn't feel like skimming a good bit. There's nothing you want to miss in these!\\n\\nIt's great for a parent to read with their child, bc anytime you can bond over something especially as they get older it's a wonderful thing.\\n\\nAnd for those adults who didn't read as a kid, go ahead, you won't be bored. Yes they're kids books but they're written on a level everyone can enjoy. That's the real magic!"
  },
  {
    "id": 5,
    "book_id": "0590353403",
    "username": "swift",
    "review_title": "first time reading the series",
    "rating": 5,
    "review_date": "2018-05-28",
    "review": "great book. i grew up during the time the books were being released but for some reason never read them at the time. i saw every movie and i loved them all. just recently i decided to start reading, the first one was free as a prime member so i thought 'why not?'. i asked my friends if i should read them even though i essentially knew what happened because i had seen the movies, they all said yes and they were right. the details are great, it makes you wish certain things from the book made it into the movies. my goal is to at least read a couple more books (it took a month each to finish the first two, just reading when i had some time) this year. it would be even better to finish the complete series but i know the books get longer so we'll see about that."
  },
  {
    "id": 6,
    "book_id": "0590353403",
    "username": "Keerthin Chandra",
    "review_title": "Love it",
    "rating": 4,
    "review_date": "2017-01-04",
    "review": "Harry potter series are the best and this part is the most interesting among all.It worth reading more than twice.Lovely quality and amazon please provide bookmarks."
  },
  {
    "id": 7,
    "book_id": "0439136350",
    "username": "Colorado Seasons",
    "review_title": "If you have a stressful job like me where you can't relax",
    "rating": 5,
    "review_date": "2016-12-19",
    "review": "I'm 46 and male who works out and thinks he's macho and I've read this book 4 times. If you have a stressful job like me where you can't relax, read the HP books. They put you in a fantasy world and JK Rowling's storytelling is so unbelievable and descriptive, she's the best. I got this series for my father after my mother passed away. They were married 69 years and he was grieving. This is not his kind of book but after reminding him how much my mother loved them, he agreed to read them and agrees it puts him in another world and helps him gain peace."
  },
  {
    "id": 8,
    "book_id": "0439136350",
    "username": "swift",
    "review_title": "My favorite book in the series! (SPOILER ALERT!!!)",
    "rating": 5,
    "review_date": "2019-01-15",
    "review": "I love all of the Harry Potter novels, but this one is by far my favorite! From the very first time I read it as a 7 year old (when the book first came out in 1999) I loved the change of pace from the other books in the series - for once, Lord Voldemort is not the main antagonist, and instead it's Sirius Black - or at least so we think! The ending contains one of the biggest plot twists in the entire series, and it's ultimately less about fighting evil and more about finding family and belonging.\\n\\nThis purchase was actually a replacement - as my first edition copy had been read so many times by me, my sister, and my parents, that the binding was pretty much destroyed and the pages quite stained (because obviously putting the book away during lunchtime is not an option for 7-12 year old Potterheads)"
  },
  {
    "id": 9,
    "book_id": "0439136350",
    "username": "Fernando",
    "review_title": "This is by far the most exciting book out of the first three",
    "rating": 4,
    "review_date": "2020-03-14",
    "review": "This is by far the most exciting book out of the first three. As the characters mature within the HP universe, so does the ever growing sense that Harry Potter is being groomed to face Hogwarts greatest foe.\\n\\nThere's a sense of repetitive narrative amongst the three books as far as the character arcs and plot twists, which rely on the complex relationship between the Gryffindor gang and Slytherin camp. But I understand that's the point of the series.\\n\\nVery emotive book with a pleasing conclusion. As I take a step back and review this for what it is a YA novel intended for any person at any age, this is a superb product.\\n\\nI really want to continue with the series but I promised myself I would pick up on another abandoned series I started 2 years ago...A song of fire and Ice. I will likely come back to Harry Potter after the summer."
  },
  {
    "id": 10,
    "book_id": "0439139597",
    "username": "Sierra Shoop",
    "review_title": "Bumps and Bruises",
    "rating": 4,
    "review_date": "2019-06-18",
    "review": "If you order this book (along with any book) keep in mind that it most likely will get beat up in the shopping process! I personally do not mind the bumps and bruises, but I know to many that it is not okay as they want these books to be in great condition. If you are planning on buying this book, or any book, for the sake of collecting them....I’d recommend going to a bookstore and purchasing it there. There’s a higher chance it won’t come damaged :) if you don’t mind bumps and bruises, ordering this book is perfect! I’ve been ordering the next book in the series when I’m about halfway through the previous book, that way the next book in the series arrives the day after I finish the previous book."
  },
  {
    "id": 11,
    "book_id": "0439139597",
    "username": "Hitesh",
    "review_title": "I never get sick of reading it again and again",
    "rating": 5,
    "review_date": "2018-10-12",
    "review": "I can never find a boring or uninteresting moment in The Goblet of Fire and I never get sick of reading it again and again as it's so easy to lose myself in Harry Potter with the astounding events and distinctive characters.Anyone who hasn't read up to The Goblet of Fire should definitely re-think that decision as this is the book where it all changes and it's then impossible to not continue reading the rest of the books."
  },
  {
    "id": 12,
    "book_id": "0439139597",
    "username": "Customer",
    "review_title": "Good but why the spoilers on front or back covers in these editions of the books??",
    "rating": 4.5,
    "review_date": "2020-12-12",
    "review": "Everything good but I have a complaint with the edition of books: why the spoilers either on the cover or the back? The Chamber of Secrets has a picture of the freaking basilisk at the front cover which takes out all of the mistery in the book. And this one at the back talks about the Triwizard Tournament and gives all details while this is secret towards the first part of the book. Obviously not my first read but if it was and I knew nothing I'd be a bit annoyed about that"
  },
  {
    "id": 13,
    "book_id": "9780439358064",
    "username": "Nathan Schwinnen",
    "review_title": "One of the best of this amazing series",
    "rating": 4,
    "review_date": "2017-07-27",
    "review": "All of the Harry Potter books are 5-star. They are so good that they make it difficult to review other books. It's almost impossible to give any other book 5 stars when compared to this series.\\n\\nIn relation to the rest of the series, The Order of the Phoenix is one of the best and most important books. If you have read the first four books and are reading reviews to see whether you should continue, you should. If you are wondering whether you can read this book without having read the first four, I don't recommend it."
  },
  {
    "id": 14,
    "book_id": "9780439358064",
    "username": "Warrior Mom",
    "review_title": "Amazing",
    "rating": 5,
    "review_date": "2018-08-25",
    "review": "I started reading this series to my 9-year-old son to see if I could interest him in chapter books. He loved the books instantly, but I will admit that the first few books were a bit too young for me.\\n\\nThis book and the last (Goblet of Fire) have been really engaging and I looked forward to our reading sessions, which are sometimes as long as 3-4 hours, if we have the time.\\n\\nThat's a long time to read aloud and I was very surprised that my rather kinetic, athletic boy kept begging for \"one more chapter!\"\\n\\nWhat a wonderful experience to share."
  },
  {
    "id": 15,
    "book_id": "9780439358064",
    "username": "KC",
    "review_title": "Great book!",
    "rating": 5,
    "review_date": "2020-07-29",
    "review": "We as a family are reading these in order. We had read all the Jim McKay versions, however, this version will not be ready until 2021, so we switched to a text version. While the loss of pictures is disappointing; the rest has been amazing. It was delivered nearly next day and we started reading it immediately! We're trying to read a chapter a day and so far, we've been hooked. It's a little more adult-themed then the previous books (if you have kids), but overall, highly recommend across the board!"
  },
  {
    "id": 16,
    "book_id": "0439784549",
    "username": "Neil",
    "review_title": "Perfect for a potterhead",
    "rating": 5,
    "review_date": "2018-10-06",
    "review": "This book with fabulous print will take u to the world of fantasy. A well recieved product with a fine binding and good paper quality."
  },
  {
    "id": 17,
    "book_id": "0439784549",
    "username": "Jules",
    "review_title": "excellent",
    "rating": 5,
    "review_date": "2020-10-17",
    "review": "I just adore harry potter! The effort, mood lifting, smart read! Its sad but yet, brilliant. I honestly am obsessed with these books, they will NOT disappoint and if you can't even be bothered to read this, What type of muggle are you!? Joanne Kathleen Rowling will of course go down in literature history, best read ever! Nobody can even create something as good as this, (cheap knock-off copys). I swear, us potter heads would want a whole new series about his new life, or his sons life of course! But there is the cursed child book but it's in a play so its sort of weird and hard to read. Thanks for reading, Evie kennedy 9 years old"
  },
  {
    "id": 18,
    "book_id": "0439784549",
    "username": "RM",
    "review_title": "Great book😍",
    "rating": 4.7,
    "review_date": "2019-01-04",
    "review": "This is so far the best book I ever read. It is very interesting. The story gets more and more interesting. I love this book a lot. The cover is very beautiful. The book arrived on time and in great condition.😍😍"
  },
  {
    "id": 19,
    "book_id": "0545010225",
    "username": "Hanna",
    "review_title": "My 10 year old read all 7 books (700-900 pages each) within months! You can't put a price on that!",
    "rating": 5,
    "review_date": "2019-07-20",
    "review": "My ten year old daughter read the entire series within a few months. One of the books is almost 900 pages and she read it in 2 weeks! Finding 1 book that keeps your child intrigued and helps him or her develop a love for reading is amazing. J.K. Rowling gave my daughter 7! And now she's reading Fantastical Beasts and Where to Find Them.\\n\\nNow I've been reading the books she's finished and her younger siblings are eager to read them as well."
  },
  {
    "id": 20,
    "book_id": "0545010225",
    "username": "Sydney",
    "review_title": "I love the series! However, the condition of the books were awful",
    "rating": 3,
    "review_date": "2018-10-04",
    "review": "I bought this book and The Half Blood Prince brand new. I received old, used, and very damaged books. I immediately contacted the seller and explained the books were very damaged, and I was sent two new books. The Half Blood Prince was fine, however the Deathly Hallows was very bent. I’m very disappointed because this is the first time I’m reading the series and I wanted aesthetically pleasing books for the collection. The story is absolutely amazing and I look forward to reading it, but still, the damage to the books make it look very unappealing."
  },
  {
    "id": 21,
    "book_id": "0545010225",
    "username": "Marveymezzo",
    "review_title": "The perfect book to cap off an amazing series",
    "rating": 5,
    "review_date": "2018-10-27",
    "review": "The progression of Harry’s story from an 11 year old just off to Hogwarts to a 17 year old off too take down Voldemort is truly remarkable. Harry has matured, and yet he’s still a teenager, with his mercurial teenaged emotions and concerns. All of Harry’s friends have likewise matured. Excellent character development is one of J. K. Rowling’s gifts to the world. If a young reader has made it this far, they deserve to keep going and finish the series. It’s a very serious book and deals with death and dying quite a bit, as well as loss, love, friendship, and redemption. You WILL cry."
  },
  {
    "id": 22,
    "book_id": "0735211299",
    "username": "Tom Venuto",
    "review_title": "Huge toolkit of actionable, practical, organized strategies to build positive habits",
    "rating": 5,
    "review_date": "2018-10-17",
    "review": "I've read a lot of books on changing behavior and building habits and James Clear's Atomic Habits is my new favorite. This book is different from others in the way it covers an enormous amount of ground in the larger area of self-improvement while seamlessly tying all these ideas back into the central theme of habits.\\n\\nOne of the core concepts in Atomic Habits is to focus on the small improvement. The impact a 1% improvement per day can make may appear negligible at first, but Clear makes a compelling argument that in the case of habits, thinking small produces the biggest results over time. \"Habits are the compound interest of self-improvement,\" explains Clear.\\n\\nOver the months and years, the accumulated effect of small habitual daily behaviors is staggering. Early in the book we are also warned that this compounding works both ways, so we'd better make sure we're making it work in the positive direction, not for the negative."
  },
  {
    "id": 23,
    "book_id": "0735211299",
    "username": "anon9668",
    "review_title": "Solid Skimmer",
    "rating": 2,
    "review_date": "2020-07-31",
    "review": "This is a solid skimmer. Just another supposed groundbreaking self-help book from some guy who has been declared an expert by repeating well known ideas to a corporate audience and can effectively write for the masses at a sixth grade level. This book is a pseudo-intellectual approach to the well known. These are all ideas that I have heard expressed better elsewhere and there isn't a single unique idea in the book. It's a book by a guy with a silver tongue, mediocre research skills, and who found a publisher with a good copy editor. It wouldn't be so cringey to read if he didn't refer to concepts as \"Laws\" which they are not, and proper noun \"Principles\" which is also barely true. Talk about self aggrandizing.\\n\\nThere is a lot of repetition here as well. This whole book could have been written in 75 pages.\\n\\nThere's nothing wrong with buying this book if you think it will help but I recommend reading the first couple of chapters and then reading chapter summaries to determine if you already know the content. Then you can dive in on anything that is new to you. I spent about an hour going cover to cover. See if you can get it used or at the Library or something. It's not worth spending more than a few bucks on."
  },
  {
    "id": 24,
    "book_id": "0735211299",
    "username": "Pravin Poojary.",
    "review_title": " Beware!! This Book can change your Life :)",
    "rating": 5,
    "review_date": "2018-10-27",
    "review": "And I absolutely mean it what I said in Headline of my comment. I have been following jamesclear.com from very long.\\n\\nHis one article has absolutely changed my life, imagine what this book can offer to you.\\n\\nI have been chasing to build many habits and experimenting with them a lot but I would always find a bit difficult to stay with my changed behavior and then while browsing on internet studying more on habits formation I stumbled on James's articles and boy this guy has the answer for habit formation.\\n\\nIf you are looking to form a new habit you have to read this Book.\\n\\nI have never commented online on any of the books that I have read but this one deserves a lot of appreciation.\\n\\nThis one is for you James, in future if you ever read this comment I want to tell you that your work has hugely impacted my life. And I express my huge gratitude towards your work on Atomic Habits and the articles you post. Thank a lot for this :)"
  },
  {
    "id": 25,
    "book_id": "0062457713",
    "username": "vvwwvv",
    "review_title": "Written by a millenial, for millenials.",
    "rating": 5,
    "review_date": "2018-09-05",
    "review": "A great read. A very entertaining romp through philosophical thought by a skilled wordsmith, but I would say the age cut-off for this book is 50. Beyond 50, you've probably already learned most of the lessons in this book the hard way, however, I can see where it can be extremely helpful for a generation that spends most of its waking hours posting narcissistic selfies on their iphones. Manson gives you the blueprints to get your head out of your ass, (or out of your phone) take a hard look at yourself and the real world around you, and shed many of the illusions you've been slowly poisoning your life with. If you're a millennial, or even a disenchanted X-gen, pick up this book. It will give you at least a more healthy point of view. But, if you're over 50, you're not going to find anything new in here except entertainment."
  },
  {
    "id": 26,
    "book_id": "0062457713",
    "username": "customer",
    "review_title": "Solid Skimmer",
    "rating": 5,
    "review_date": "2018-07-02",
    "review": "This book is a game changer. It makes you think in a way you never have.. Must read for people who think they are depressed, 'something is wrong with me',, 'why me' type of questions.. Trust me there is nothing wrong with you.. an eye opener for me truly. Just order it already !!!"
  },
  {
    "id": 27,
    "book_id": "0062457713",
    "username": "Diya",
    "review_title": "Didn't like it much",
    "rating": 3,
    "review_date": "2018-10-24",
    "review": "Overrated. Didn't like it much. There were times I felt the author is contradicting himself. In the first few pages he tries hard to convey the message that you are plain average but towards the end of the book he conveys the opposite - that you are special :) It is different from other self-help books in the way that it doesn't glorify you as someone who is unique and one of a kind. He says that feeling entitled is the reason why people care about unimportant things the way they do. So don't get confused by the title (like I did), the entire book is more about how to not take yourself so seriously.\\n\\nP.S: If you are looking to feel good, this might not be your cup of tea."
  },
  {
    "id": 28,
    "book_id": "0062888439",
    "username": "vvwwvv",
    "review_title": "Written by a millenial, for millenials.",
    "rating": 5,
    "review_date": "2018-09-05",
    "review": "A great read. A very entertaining romp through philosophical thought by a skilled wordsmith, but I would say the age cut-off for this book is 50. Beyond 50, you've probably already learned most of the lessons in this book the hard way, however, I can see where it can be extremely helpful for a generation that spends most of its waking hours posting narcissistic selfies on their iphones. Manson gives you the blueprints to get your head out of your ass, (or out of your phone) take a hard look at yourself and the real world around you, and shed many of the illusions you've been slowly poisoning your life with. If you're a millennial, or even a disenchanted X-gen, pick up this book. It will give you at least a more healthy point of view. But, if you're over 50, you're not going to find anything new in here except entertainment."
  },
  {
    "id": 29,
    "book_id": "0062888439",
    "username": "customer",
    "review_title": "Solid Skimmer",
    "rating": 5,
    "review_date": "2018-07-02",
    "review": "This book is a game changer. It makes you think in a way you never have.. Must read for people who think they are depressed, 'something is wrong with me',, 'why me' type of questions.. Trust me there is nothing wrong with you.. an eye opener for me truly. Just order it already !!!"
  },
  {
    "id": 30,
    "book_id": "0062888439",
    "username": "Diya",
    "review_title": "Didn't like it much",
    "rating": 3,
    "review_date": "2018-10-24",
    "review": "Overrated. Didn't like it much. There were times I felt the author is contradicting himself. In the first few pages he tries hard to convey the message that you are plain average but towards the end of the book he conveys the opposite - that you are special :) It is different from other self-help books in the way that it doesn't glorify you as someone who is unique and one of a kind. He says that feeling entitled is the reason why people care about unimportant things the way they do. So don't get confused by the title (like I did), the entire book is more about how to not take yourself so seriously.\\n\\nP.S: If you are looking to feel good, this might not be your cup of tea."
  },
  {
    "id": 31,
    "book_id": "0385541198",
    "username": "Customer",
    "review_title": "Not Grisham's Best Effort - Boring and Uneven",
    "rating": 3,
    "review_date": "2016-10-26",
    "review": "I am a Grisham fan but this is not his best work. If there is such a thing, I would call this a boring page-turner. You keep turning the pages expecting it to get better but then you get to the end and realize---that was it. I mean it has all the nuts and bolts of a solidly written piece of fiction but there is just no spark to it, nothing clever or surprising. After I'd turned all the pages, I blinked several times and turned off my kindle - surprised that it was over because it never quite got off the ground. The characters are one-dimensional and there is no real connection to them. Like the heroine in Gray Mountain, the female lead in this book is totally vanilla. You're not rooting for her or against her as there is little depth or character development.\\n\\n* some spoilers\\n\\nThe plot is laid out early in the book - there is a corrupt judge colluding with some thugs to skim money at an Indian casino. To expose the corruption, there are a few individuals trying to blow the whistle on the judge to collect cash under the whistle-blower statutes. The whistle-blowers submit a complaint to the agency that investigates rogue judges and an investigation begins. These facts are known early on. The problem is - that's the entire plot. There are no twists or turns it goes in a fairly straight line from corruption complaint to indictments with few surprises along the way. There is also a huge loose end as we never find out what happens to one of the characters who was falsely imprisoned for murders he did not commit. Since this character is a main focus in the prequel, the failure to tie up that loose end is irritating.\\n\\nAll in all - it is just an uneven effort. A disappointing novel from an author from whom we all expect better."
  },
  {
    "id": 32,
    "book_id": "0385541198",
    "username": "Kindle Customer Mr. R",
    "review_title": "Another Grisham winner",
    "rating": 5,
    "review_date": "2021-11-22",
    "review": "This book is another Grisham winner. I've read almost all of his books. They're easy reading and interesting. There's a lot to learn about our justice system from Mr. Grisham's books. His writing is unpretentious and crystal clear. I've never been disappointed, even when the subject of his some of his writings are not really my main interests. He includes sports peripherally in his works. There's no foul language in his books. He includes intimacy without vulgarity. His characters are solid with likeable protagonists and it's easy to dislike the antagonists."
  },
  {
    "id": 33,
    "book_id": "0385541198",
    "username": "La Colyn",
    "review_title": "Disappointing",
    "rating": 4,
    "review_date": "2018-01-04",
    "review": "I haven't read any of his books for a long while, having always enjoyed them in the past. Apart from a central event the narrative holds few surprises and lacks suspense. The writing is pretty perfunctory and I could have stopped reading about 2/3 of the way through and not worried how it would turn out. I hope his others that I read when I was much younger were indeed better and that my younger self wasn't just less critical."
  },
  {
    "id": 34,
    "book_id": "0385546025",
    "username": "gsxr",
    "review_title": "Long, slow, plodding cat and mouse",
    "rating": 1,
    "review_date": "2021-10-19",
    "review": "I had anticipated that this would be an exciting and tightly written thriller, and I downloaded it a few minutes after it became available, but I was disappointed.\\n\\nThis is not a whodunnit, we are told the names of the killer and the principle protagonists from the beginning of this book. It is very slow to develop, and follows predictable plot lines every step of the way. There is virtually no action in this book, very little suspense, no twists, no thrills.\\n\\nAbout 80% of the way through, the story starts to heat up and becomes briefly entertaining, but that action peaks almost immediately and then the story falls into a continued long and drawn out anti-climax. It ends and I wondered why I spent hours reading this book.\\n\\I read quite a few and liked Grisham’s earlier novels. I could not get excited about this one at all."
  },
  {
    "id": 35,
    "book_id": "0385546025",
    "username": "Love2Read",
    "review_title": "A waste of time",
    "rating": 2,
    "review_date": "2021-10-23",
    "review": "I’ve been a Grisham fan for decades and I can hardly believe he wrote this book. He either had a ghost writer or just “phoned it in.” The writing is awful, the characters are one dimensional, and the story is unbelievably bad. Sociopathic serial killer judge who, of course, is so brilliant that he’s stayed out of trouble for over 20 years while he seeks revenge on people who have wronged him. And don’t even get me started on the ending. Give me a break. I couldn’t decide whether to give it one star or two. Don’t waste your time.."
  },
  {
    "id": 36,
    "book_id": "0385546025",
    "username": "gsxr",
    "review_title": "THE JUDGE’S LIST",
    "rating": 5,
    "review_date": "2021-10-19",
    "review": "I loved this book = could not put it down❗️. I have read quite a few of Grisham’s books and this is one of his best ( in my opinion ), altho’ = I enjoyed them all ~"
  },
  {
    "id": 37,
    "book_id": "1612680194",
    "username": "Ilive4him24",
    "review_title": "Everything",
    "rating": 5,
    "review_date": "2018-03-17",
    "review": "I read this book about 11 years ago at 27 years old , had no money, I followed the advice in this book and now have 15 rental properties paid off free and clear, my assets more than cover all my expenses. I just bought this book again, I'm in the middle of reading it again now 11 years later and can't put it down. I hate reading btw. I plan on reading this book at least three more times over the next 20 years so I can keep all info fresh in my mind. People always ask me about success. I tell them to read this book...whats crazy is that they don't read it. You can lead a horse to water but can't make it drink. The book changed my life and it will change yours. Do you want change or do you just want to talk and think about change? There is a big difference , do it."
  },
  {
    "id": 38,
    "book_id": "1612680194",
    "username": "Mister E2",
    "review_title": "Rich Motivation, Poor Examples, Fun to Read",
    "rating": 3,
    "review_date": "2018-05-19",
    "review": "A very motivational book without a lot of practical steps to magically achieve the goals listed. Some inaccurate information such as Charles Schwab dying penniless. More important is the author filed for bankruptcy in 2012. Why is that? Research it on your own. For most people this will motivate them to THINK differently and think outside the box, but not necessarily ACT differently, as we still need money to live on and have to work some and not just dream big without action and income behind it. This books contrasts another book \"The Millionaire Next Door.\" Some of the examples that seem to be his idols are a bit scary too, like Ray Kroc. I'd rather apply Biblical money principles from people like Dave Ramsey. All in all a fun good read for mental stimulation. Take it with a grain of salt and don't blindly follow it 100%"
  },
  {
    "id": 39,
    "book_id": "1612680194",
    "username": "Tanmay Sharma",
    "review_title": "What the rich teach their kids about money-that poor amd middle class do not.",
    "rating": 5,
    "review_date": "2018-11-25",
    "review": "If the sentence above made you wonder, you should totally buy this book. The book is totally about its tagline. I read 100 pages in just two days (103 to be exact), this book is really interesting if you truly wanna know that what the rich teach their kids about money. Coz surely if you belong to a middle class family, you're familiar with this statement \"job are secure, businesses are too risky\". Well the book beautifully explains that how many more variables the above statement has. With simple language used, the way it teaches is quite impressive. Highly recommended for anyone who is thinking of a start-up, to give him a better insight about what it actually is, and how to make it work. Coz you know at the end of the day, it's all about execution. No idea is good or bad it's the proper execution that matters. A must read for graduates. If the tag line of the book made you wonder, well, you should totally buy it to know the answer."
  },
  {
    "id": 40,
    "book_id": "074349346X",
    "username": "Frank Donnelly",
    "review_title": "A Very Good Second Novel, The First Robert Landon Novel",
    "rating": 4,
    "review_date": "2019-02-18",
    "review": "\"Angels & Demons\" is a very good suspense thriller set primarily in The Vatican City. The novel is the second novel by Dan Brown, the first being \"Digital Fortress\". This is the first of the \"Robert Langdon\" series. It is a medium length, fast paced novel that is written in modern conversational English and is mostly an easy read. The chapters are mostly short and the novel can be read in intervals during work breaks, etc., without losing the flow of the story. I liked it very much.\\n\\nAlthough somewhat similar in format to \"Digital Fortress\" this novel marks a distinct improvement and the story line is completely independent of \"Digital Fortress\". There is little or no gratuitous vulgar language in this novel, another distinct improvement over \"Digital Fortress\". \"Angels & Demons\" is dedicated specifically to Dan Brown's mother and I cannot help but wonder if this elevated the author's lexicon to a level more consistent with good literature. The first novel was dedicated to both of his parents.\\n\\nThe novel is primarily set in Vatican City and is a mystery thriller. The story requires detective work of a more academic nature than the average violent street felony. Although I am a retired detective and I read a good bit, I would not have been able to work though this case on my own, in the time allotted in the novel, without Robert Langdon's expertise. I really enjoyed the academic aspect of this novel and this was my favorite part of the novel. I did parallel reading and learned a good deal.\\n\\nThis novel features yet another semi omniscient uber villain who cannot resist spewing background information to his victims. Personally I last encountered this in \"The Lincoln Letter\", another academic mystery novel. I never encountered villains of this nature in my professional career and I have concluded that this is a literary device to shorten and simplify the story. I preferred this novel over \"The Lincoln Letter\".\\n\\nIn summary, I really enjoyed this novel. It is a distinct improvement over the author's first novel. The two stories stand alone and a reader can skip the first novel without missing anything in this second novel. Although very academic it is still a relatively easy read and I prefer it to other mystery novels by contemporary American male authors such as James Patterson and Dean Koontz. I mean no disrespect to them, I just liked this novel better. Thank You..."
  },
  {
    "id": 41,
    "book_id": "074349346X",
    "username": "Dmytro",
    "review_title": "primitive and illogical",
    "rating": 1,
    "review_date": "2018-09-23",
    "review": "Couldn't make it past 10%\\n\\nCERN director, supposedly a physicist and a man of science behaves like a kid, making far going conclusios from nearly absent evidence. No scientist would ever thought like that.\\n\\nI see a symbol — that must be illuminati. Find them! What? What do you mean illumati do not exist? But the symbols is there, so your words must be a lie!\\n\\n And all that considering, no one ever saw an illumati insigna before, according to Dan Brown.\\n\\nThis is a disgustingly primitive and illogical book."
  },
  {
    "id": 42,
    "book_id": "074349346X",
    "username": "Mindo'ermatter",
    "review_title": "Dan Brown's First Controversial Novel",
    "rating": 5,
    "review_date": "2019-08-18",
    "review": "A neverending sequence of crises and turmoil, this first of the Robert Langdon series was Dan Brown's third novel. It's fast-paced action makes it a fun read, although some of the backstories often were distracting and wisely eliminated from the movie version. The historical context and scientific elements added interest, while often misstating reality and adding information that sometimes bogged down the story, but overall, it was an enjoyable fictional reading experience.\\n\\nThe characters were interesting with a few fully developed, yet complex enough for their motives to vary and become conflicted as the story progressed. Although much of the religious information was accurate, Brown obviously ignored, adapted, or invented several elements. As such, this is a novel garnished with some truth.\\n\\nI generally like the author's style and intense tone, while only wishing he used fewer words to make the storyline more consistent with the actual time realistically available to the characters."
  }
]
